In [1]:
import pandas as pd
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

Шаги № 2 и № 3 блока «4.5 Задача классификации. Соревнование по датасету titanic»

1) Задача набрать более 76% на тестовом датасете kaggle
2) Задача набрать более 80% на тестовом датасете kaggle

In [2]:
df_titanic_train = pd.read_csv('train(titanic).csv')
df_titanic_test = pd.read_csv('test(titanic).csv')

In [3]:
df_titanic_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
df_titanic_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

Удалим колонку 'Cabin', т.к. в ней наблюдается много пропусков

In [5]:
df_titanic_train.drop(labels=['Cabin'], axis=1, inplace=True)
df_titanic_test.drop(labels=['Cabin'], axis=1, inplace=True)

In [6]:
df_titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [7]:
df_titanic_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

In [8]:
df_titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [9]:
df_titanic_test.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

Удалим также колонки 'PassengerId', 'Name', 'Ticket', т.к. они не понадобятся для обучения модели

In [10]:
df_titanic_train.drop(labels=['PassengerId', 'Name', 'Ticket'], axis=1, inplace=True)
df_titanic_test.drop(labels=['PassengerId', 'Name', 'Ticket'], axis=1, inplace=True)

В колонках 'Age' и 'Fare' можно заменить пропуски средними значениями

In [11]:
df_titanic_train['Age'].fillna(df_titanic_train['Age'].mean(), inplace=True)
df_titanic_test['Age'].fillna(df_titanic_test['Age'].mean(), inplace=True)
df_titanic_test['Fare'].fillna(df_titanic_test['Fare'].mean(), inplace=True)

В колонках 'Embarked' можно заменить пропуски модой

In [12]:
df_titanic_train['Embarked'].mode()

0    S
Name: Embarked, dtype: object

In [13]:
df_titanic_train['Embarked'].fillna('S', inplace=True)

Проверим количество пропусков

In [14]:
df_titanic_train.isna().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [15]:
df_titanic_test.isna().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

Колонки 'Sex' и 'Embarked' нужно привести к числовым. Для этого нужно понять какие значения есть в данных колонках

In [16]:
df_titanic_train['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [17]:
df_titanic_test['Sex'].value_counts()

male      266
female    152
Name: Sex, dtype: int64

In [18]:
sex_dict = {'male': 0, 'female': 1}
df_titanic_train['Sex'].replace(sex_dict, inplace=True)
df_titanic_test['Sex'].replace(sex_dict, inplace=True)

In [19]:
df_titanic_train['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [20]:
df_titanic_test['Embarked'].value_counts()

S    270
C    102
Q     46
Name: Embarked, dtype: int64

In [21]:
embarked_dict = {'S': 0, 'C': 1, 'Q': 2}
df_titanic_train['Embarked'].replace(embarked_dict, inplace=True)
df_titanic_test['Embarked'].replace(embarked_dict, inplace=True)

Обучим модель логистической регрессии для предсказания значений в колонке 'Survived' и получим предсказания для тестовых данных

In [22]:
model = LogisticRegression()
x = df_titanic_train.loc[:,df_titanic_train.columns != 'Survived']
y = df_titanic_train['Survived']
model.fit(x, y)
y_pred = model.predict(df_titanic_test)

Сравним полученные предсказания с правильными ответами

In [23]:
df_gender_submission = pd.read_csv('gender_submission(titanic).csv')
df_gender_submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [24]:
df_true_answers = df_gender_submission['Survived']

In [25]:
print(accuracy_score(df_true_answers, y_pred) * 100)

94.25837320574163